from dash import Dash, html, dcc, Input, Output, State, ctx, register_page

home = register_page(__name__, path='/')

layout = html.Div(children=[
    html.H1(className='center', children='Home',),

    html.Pre(className='center', children=f'''
    
                                                                                               
               เนื่องจากการลงทุนในสินทรัพย์ (Asset) ต่างๆเริ่มเป็นที่สนใจและเป็นที่ต้องการมากขึ้นในปัจจุบัน         
                                                                                               
        เพราะว่าจากอัตราเงินเฟ้อที่เพิ่มขึ้นและเศรษฐกิจที่ฝืดเคือง ทำให้การถือเงินสด (Cash) ไว้เฉยๆหรือ             
                                                                                               
        การนำเงินสดไปฝากไว้ในธนาคาร ก็มีแต่จะทำให้ได้รับผลตอบแทน (Yield) ไม่คุ้มค่าเท่าแต่ในอดีต             
                                                                                               
        ดังนั้นการลงทุนในสินทรัพย์อื่นๆ เช่น กองทุนรวม (Mutual Fund), หุ้น (Stock), ตราสารสิทธิ              
                                                                                               
        ที่ให้สิทธิแก่ผู้ซื้อหรือผู้ถือ(Option) เป็นต้น จึงเป็นที่สนใจและต้องการมากยิ่งขึ้นในหมู่คนทั่วไป                
                                                                                               
                                                                                               
                                                                                               
               การจะลงทุนให้ได้รับผลตอบแทนที่คุ้มค่าที่สุด ควรจะต้องมีการศึกษาหาความรู้ให้มาก เพื่อที่จะใช้         
                                                                                               
        ความรู้และประสบการณ์ที่มีในการหาจังหวะเพื่อลงทุนให้ถูกต้องและเกิดประโยชน์สูงสุด โดยการลงทุนที่            
                                                                                               
        มีคนให้ความสนใจมากและมีโอกาสได้รับผลตอบแทนสูงถึงแม้ว่าจะมีความเสี่ยงที่สูงขึ้นมากกว่าการฝากเงิน          
                                                                                               
        สดไว้ในธนาคารก็ตาม ก็คือการลงทุนในหุ้น และวิธีการลงทุนในหุ้นที่เข้าใจง่ายและสามารถทำให้ได้รับ             
                                                                                               
        ผลตอบแทนที่สูงวิธีหนึ่งคือ การซื้อหุ้นด้วยราคาที่ต่ำ และนำหุ้นไปขายเมื่อราคาสูงขึ้น ซึ่งเราจะได้กำไร            
                                                                                               
        จากส่วนต่างราคาที่เป็นส่วนกำไรที่ได้รับ (Capital Gain)                                           
                                                                                               
                                                                                               
                                                                                               
               ถึงแม้ว่าวิธีการทำกำไรด้วยการซื้อหุ้นที่ราคาต่ำแล้วนำไปขายในราคาที่สูงที่จะทำให้เราได้รับ              
                                                                                               
        Capital Gain นั้นจะดูเหมือนเป็นวิธีการที่ทำได้ง่ายๆ แต่ในความเป็นจริงแล้ว ราคาของหุ้นนั้นมีความผันผวน       
                                                                                               
        อย่างมากและไม่สามารถทำนายได้ล่วงหน้าอย่างแม่นยำ ผู้จัดทำโครงงานและผู้คนรอบข้างซึ่งมีความสนใจ          
                                                                                               
        ในการลงทุนในหุ้นด้วยวิธีซื้อถูก-ขายแพง จึงเป็นที่มาของความต้องการเครื่องมือที่จะมาช่วยเสริมในการ            
                                                                                               
        ตัดสินใจหาจุดซื้อ-จุดขายที่จะช่วยผู้ใช้ในการวิเคราะห์การลงทุน โดยใช้การเรียนรู้ของเครื่อง (Machine Learning)| 
                                                                                               
        ช่วยในการหาจุดซื้อ-จุดขายที่เหมาะสมและจะได้กำไรสูงสุด                                            
                                                                                               
                                                                                               
                                                                                               
               โดยการจะทำนายจุดซื้อ-จุดขายที่เหมาะสมในอนาคตมาได้นั้น จะต้องรู้ราคาของหุ้นในอนาคตโดย         
                                                                                               
        ได้มาจากการใช้ Machine Learning มาทำนายราคาโดยการฝึกฝนด้วยราคาหุ้นในอดีต และการจะทำนาย        
                                                                                               
        จุดซื้อ-จุดขายที่แม่นยำนั้นก็ควรจะต้องฝึกฝน Machine Learning ด้วยจุดซื้อ-จุดขายในอดีตเช่นเดียวกัน         
                                                                                               
                                                                                               
                                                                                               
               จึงเป็นที่มาของโครงงานนี้ เพื่อพัฒนาและต่อยอดแบบจำลอง (Model) ที่จะสามารถทำนายราคาใน       
                                                                                               
        อนาคตให้ใกล้เคียงที่สุด เพื่อที่จะหาจุดซื้อ-จุดขายของราคาหุ้นในอนาคตที่จะทำให้ได้รับผลตอบแทนจาก          
                                                                                               
        การลงทุนที่สูงที่สุดและคุ้มค่ากับเงินลงทุนที่สุด                                                     
                                                                                               
    ''',)
])